import '../../models/place_model.dart';

List<Place> places = [
  Place(
      name: "কান্তজিউ মন্দির",
      imageUrlsOfSelectedPlace: [
        'assets/images/kantajir/kantajir_temple.jpg',
        'assets/images/kantajir/kantajir2.jpg',
        'assets/images/kantajir/kantajir3.jpg',
        'assets/images/kantajir/kantajir4.jpg',
        'assets/images/kantajir/kantajir5.jpg',
      ],
      firstDescription:
          "কান্তজিউ মন্দির, দিনাজপুর জেলায় অবস্থিত একটি মধ্যযুগীয় হিন্দু মন্দির, যা মহারাজা প্রাণনাথ রায় শ্রীকৃষ্ণ ও রুক্মিণীকে উৎসর্গ করে ১৭০৪ সালে নির্মাণ শুরু করেন এবং ১৭৫২ সালে তাঁর পুত্র রামনাথ রায় সম্পন্ন করেন। মন্দিরের নবরত্ন বা নয় শিখর ১৮৯৭ সালের ভূমিকম্পে ধ্বংস হয়। এটি বাংলাদেশের সর্বোৎকৃষ্ট টেরাকোটা শিল্পের নিদর্শন, যেখানে পৌরাণিক কাহিনীর অলঙ্করণ রয়েছে। \nমন্দিরের নির্মাণে পার্সি শিল্পীদের ব্যবহার হয়, এবং তারা নয়াবাদ গ্রামে বসবাস করেন, যেখানে একটি মসজিদও নির্মিত হয়। প্রতি বছর শীতের শুরুতে রাস মেলা অনুষ্ঠিত হয়, যা মহারাজা রামনাথ রায়ের সময় থেকে চালু।",
      position:
          "মন্দিরটি দিনাজপুর শহর থেকে ২০ কিলোমিটার উত্তরে এবং কাহারোল উপজেলা সদর থেকে ৮ কিলোমিটার দক্ষিণ-পূর্বে সুন্দরপুর ইউনিয়নে, দিনাজপুর-তেঁতুলিয়া মহাসড়কের পশ্চিমে ঢেঁপা নদীর তীরবর্তী গ্রাম কান্তনগরে অবস্থিত।",
      history:
          "মন্দিরের উত্তর দিকের ভিত্তিবেদীর শিলালিপি থেকে জানা যায়, তৎকালীন দিনাজপুরের মহারাজা জমিদার প্রাণনাথ রায় তার শেষ বয়সে মন্দিরের নির্মাণ কাজ শুরু করেন। ১৭২২ খ্রিষ্টাব্দে তার মৃত্যুর পরে তার শেষ ইচ্ছা অনুযায়ী তার পোষ্যপুত্র মহারাজা রামনাথ রায় ১৭৫২ খ্রিষ্টাব্দে মন্দিরটির নির্মাণ কাজ শেষ করেন। শুরুতে মন্দিরের চূড়ার উচ্চতা ছিলো ৭০ ফুট। ১৮৯৭ খ্রিষ্টাব্দে মন্দিরটি ভূমিকম্পের কবলে পড়লে এর চূড়াগুলো ভেঙে যায়। বিশ শতকের শুরুর দিকে মহারাজা গিরিজানাথ মন্দিরের ব্যাপক সংস্কার করলেও মন্দিরের চূড়াগুলো আর সংস্কার করা হয়নি।",
      architecture:
          "মন্দিরের বাইরের দেয়াল জুড়ে পোড়ামাটির ফলকে রামায়ণ, মহাভারত এবং বিভিন্ন পৌরাণিক কাহিনী চিত্রায়ণ করা আছে। পুরো মন্দিরে প্রায় ১৫,০০০-এর মতো টেরাকোটা টালি রয়েছে।[১০] উপরের দিকে তিন ধাপে উঠে গেছে মন্দিরটি। মন্দিরের চারদিকের সবগুলো খিলান দিয়েই ভেতরের দেবমূর্তি দেখা যায়। মন্দির প্রাঙ্গণ আয়তাকার হলেও, পাথরের ভিত্তির উপরে দাঁড়ানো ৫০ ফুট উচ্চতার মন্দিরটি বর্গাকার। নিচতলার সব প্রবেশপথে বহু খাঁজযুক্ত খিলান রয়েছে। দুটো ইটের স্তম্ভ দিয়ে খিলানগুলো আলাদা করা হয়েছে, স্তম্ভ দুটো খুবই সুন্দর এবং সমৃদ্ধ অলংকরণযুক্ত। মন্দিরের পশ্চিম দিকের দ্বিতীয় বারান্দা থেকে সিঁড়ি উপরের দিকে উঠে গেছে। মন্দিরের নিচতলায় ২১টি এবং দ্বিতীয় তলায় ২৭টি দরজা-খিলান রয়েছে, তবে তৃতীয় তলায় রয়েছে মাত্র ৩টি করে।"),
  Place(
      name: "নয়াবাদ মসজিদ",
      imageUrlsOfSelectedPlace: [
        'assets/images/nayabad_mosque/nayabad_mosque.jpg',
        'assets/images/nayabad_mosque/nayabad2.jpg',
        'assets/images/nayabad_mosque/nayabad3.jpg',
        'assets/images/nayabad_mosque/nayabad4.jpg',
        'assets/images/nayabad_mosque/nayabad5.jpg',
      ],
      firstDescription:
          "নয়াবাদ মসজিদ ১৭৯৩ খ্রিস্টাব্দে বর্তমান বাংলাদেশের দিনাজপুর শহর হতে প্রায় ২০ কিলোমিটার দূরে কাহারোল উপজেলার নয়াবাদ গ্রামে অবস্থিত। মসজিদটির পাশ দিয়ে চলে গেছে ঢেপা নদী। ১.১৫ বিঘা জমির উপর এই মসজিদটি তৈরি করা হয়েছে।মসজিদটিতে মোট ৪টি গম্বুজ রয়েছে। এটি বাংলাদেশ প্রত্নতত্ত্ব অধিদপ্তর এর তালিকাভুক্ত একটি প্রত্নতাত্ত্বিক স্থাপনা।[১] এটি ইট, টেরাকোটা, টাইল দিয়ে নির্মিত।[",
      position:
          "নয়াবাদ মসজিদ বাংলাদেশের দিনাজপুর শহর হতে প্রায় ২০ কিলোমিটার দূরে কাহারোল উপজেলার নয়াবাদ গ্রামে অবস্থিত",
      history:
          "মসজিদের প্রবেশের প্রধান দরজার উপর স্থাপিত ফলক হতে জানা যায় এটি সম্রাট দ্বিতীয় শাহ আলমের রাজত্ব কালে ২ জৈষ্ঠ্য, ১২০০ বঙ্গাব্দে(ইংরেজি ১৭৯৩ সালে) নির্মাণ করা হয়। সেসময় জমিদার ছিলেন রাজা বৈদ্যনাথ। যিনি ছিলেন দিনাজপুর রাজ পরিবারের সর্বশেষ বংশধর। এলাকার অধিবাসীদের থেকে জানা যায় যে, ১৮ শতকের মাঝামাঝিতে কান্তনগর মন্দির তৈরির কাজে আগত মুসলমান স্থপতি ও কর্মীরা এই মসজিদটি তৈরি করেন। তারা পশ্চিমের কোন দেশ থেকে এসে নয়াবাদে বসবাস শুরু করে এবং তাদের নিজেদের ব্যবহারের জন্য এই মসজিদটি তৈরি করে।",
      architecture:
          "তিন গম্বুজ বিশিষ্ট এই মসজিদের চার কোনে ১২.৪৫মিটার x ৫.৫মিটার আকারের চারটি অষ্টভুজ মিনার রয়েছে। দেয়ালগুলির পুরুত্ব ১.১০ মিটার। উত্তর ও দক্ষিণের দেয়ালে একটি করে জানালা রয়েছে। পশ্চিম পাশের দেয়ালে মোট তিনটি মিম্বার রয়েছে যেগুলি মসজিদের তিনটি প্রবেশ দরজা বরাবর তৈরি করা হয়েছে। মাঝের মিম্বারটি আকারে বড়(উচ্চতা ২৩০ মিটার এবং প্রস্থ্য ১.০৮ মিটার) এবং অপর দুটি মিম্বার একই আকারের।\nমসজিদটা তৈরির সময় যে সকল টেরাকেটা বা পোড়ামাটির কারুকার্য ব্যবহার করা হয়েছিল তার অধিকাশংই এখন নেই এবং যেগুলি রয়েছে সেগুলিও সম্পূর্ণ অক্ষত নেই। এখানে বর্তমান মোট ১০৪টি টেরাকোটা অবশিষ্ট রয়েছে। এগুলি আয়তক্ষেত্রাকার এবং আকার ০.৪০মিটার x০.৩০ মিটার।\nমসজিদটির পাশে একটি কবর রয়েছে। তবে কবর বা মসজিদে কোন অংশেই এটি সম্পর্কিত কোন তথ্য দেয়া নেই। তবে কথিত আছে যে এটি মসজিদের কোন নির্মাণ শ্রমিকের কবর।"),
  Place(
      name: "রামসাগর",
      imageUrlsOfSelectedPlace: [
        'assets/images/ramsagar/ramsagar.jpg',
        'assets/images/ramsagar/ramsagor2.jpg',
        'assets/images/ramsagar/ramsagor3.jpeg',
        'assets/images/ramsagar/ramsagor4.jpeg',
        'assets/images/ramsagar/ramsagor5.jpeg',
      ],
      firstDescription:
          "রামসাগর, দিনাজপুর জেলার তাজপুর গ্রামে অবস্থিত বাংলাদেশের বৃহত্তম মানবসৃষ্ট দীঘি। এর আয়তন ৪,৩৭,৪৯২ বর্গমিটার, দৈর্ঘ্য ১,০৩১ মিটার, প্রস্থ ৩৬৪ মিটার এবং গড় গভীরতা প্রায় ১০ মিটার। দীঘির পাড়ের উচ্চতা ১৩.৫ মিটার। পশ্চিম পাড়ের মধ্যখানে একটি ঘাট ছিল, যার কিছু অবশিষ্ট এখনও রয়েছে। ঘাটটি বেলেপাথর স্ল্যাব দ্বারা নির্মিত এবং এর দৈর্ঘ্য ৪৫.৮ মিটার, প্রস্থ ১৮.৩ মিটার।",
      position:
          "দিনাজপুর জেলা শহর থেকে প্রায় ৮ কিলোমিটার (৮,০০০ মি) দক্ষিণে তাজপুর গ্রামে দীঘিটি অবস্থিত।",
      history:
          "ঐতিহাসিকদের মতে, দিনাজপুরের রাজা রামনাথ (১৭২২-১৭৬০) পলাশীর যুদ্ধের আগে রামসাগর দিঘি খনন করেন। তার নামানুসারে এর নামকরণ করা হয় রামসাগর। খনন করতে প্রায় ৩০,০০০ টাকা এবং ১৫,০০,০০০ শ্রমিকের প্রয়োজন ছিল। ১৯৬০ সালে এটি বন বিভাগের তত্ত্বাবধানে আসে, এবং ১৯৯৫-৯৬ সালে আধুনিক পর্যটনকেন্দ্র হিসেবে গড়ে তোলা হয়। ২০০১ সালের ৩০ এপ্রিল এটিকে জাতীয় উদ্যান হিসেবে ঘোষণা করা হয়।",
      architecture:
          "রামসাগর দিঘি নিয়ে দুটি প্রধান লোককথা প্রচলিত রয়েছে। একটি অনুযায়ী, ১৭৫০ সালে খরার কারণে রাজা প্রাণনাথ স্বপ্নে নির্দেশ পেয়ে ১৫ দিনে একটি পুকুর খনন করেন, কিন্তু পানি না ওঠায় আবার স্বপ্নে দৈববাণী শুনে তার ছেলে রামকে বলি দিতে বলেন। যুবরাজ রামনাথ মন্দিরে প্রবেশ করার পর পানি ওঠে এবং দিঘি পূর্ণ হয়ে যায়। অন্য একটি কাহিনী অনুযায়ী, রাজার স্বপ্নে দেখা যায় যে, কেউ প্রাণ বিসর্জন দিলে পানি উঠবে, তখন রাম নামে এক যুবক প্রাণ বিসর্জন দেয়, এবং সেই নামেই দিঘির নামকরণ করা হয় রামসাগর।"),
  Place(
      name: "স্বপ্নপুরী",
      imageUrlsOfSelectedPlace: [
        'assets/images/swapno_puri/swapno.jpg',
        'assets/images/swapno_puri/swapno2.jpeg',
        'assets/images/swapno_puri/swapno3.jpeg',
        'assets/images/swapno_puri/swapno4.jpeg',
        'assets/images/swapno_puri/swapno5.png',
      ],
      firstDescription:
          "স্বপ্নপুরী বাংলাদেশের দিনাজপুর জেলায় অবস্থিত একটি কৃত্রিম চিত্তবিনোদন পার্ক।",
      position:
          "স্বপ্নপুরী রংপুর বিভাগের দিনাজপুর জেলার নবাবগঞ্জ উপজেলার আফতাবগঞ্জে অবস্থিত। যা উপজেলা সদর থেকে ১৫ কি:মি: উত্তর দিকে ৯ নং কুশদহ ইউনিয়ন পরিষদের অধীন খালিপপুর মৌজার মধ্যে পরে ।",
      history:
          "কুশদহ ইউনিয়নের চেয়ারম্যান মো: দেলওয়ার হোসেন তার শ্রম ও অর্থের বিনিময়ে ১৯৮৯ সালে স্বপ্নপুরীর কাজ শুরু করেন।",
      architecture:
          "একটি কৃত্রিম হ্রদ\nএকটি রবীন্দ্রনাথ ঠাকুরের ভাস্কর্য\nভাস্কর্য পরী\nভাস্কর্য ডাইনোসরের"),
  Place(
      name: "দিনাজপুর রাজবাড়ি",
      imageUrlsOfSelectedPlace: [
        "assets/images/rajbari/rajbari.jpg",
        "assets/images/rajbari/rajbari2.jpg",
        "assets/images/rajbari/rajbari3.jpg",
        "assets/images/rajbari/rajbari4.jpg",
      ],
      firstDescription:
          "দিনাজপুর রাজবাড়ি বাংলাদেশের রংপুর বিভাগের দিনাজপুর জেলার সদর উত্তর-পূর্ব দিকে অবস্থিত। 'রাজবাটী' গ্রামের সন্নিকটে এই স্থানটি “রাজ বাটিকা” নামে বিশেষভাবে পরিচিত। উল্লেখ্য যে, প্রাচীন এই রাজ বাড়িটির নামেই গ্রামের নামকরণ হয়েছে।",
      position: "এটি দিনাজপুর কেন্দ্রীয় বাসটার্মিনাল এর পূর্বে অবস্থিত।",
      history:
          "দিনাজপুর রাজবাড়ি ও রাজ্য রাজা দিনরাজ ঘোষ স্থাপন করেন। কিন্তু অনেকের মতামত পঞ্চদশ শতকের প্রথমার্ধে ইলিয়াস শাহীর শাসনামলে সুপরিচিত “রাজা গণেশ” এই বাড়ির স্থপতি। রাজা দিনরাজ ঘোষ গৌড়েশ্বর গণেশনারায়ণের (১৪১৪-১৪১৮ খ্রি:) অন্যতম রাজকর্মচারী। তিনি ছিলেন উত্তর রাঢীয় শ্রেণীর কুলীন কায়স্থ। রাজা দিনরাজের নাম থেকেই রাজ্যের নাম হয় 'দিনরাজপুর', যা বারেন্দ্র বঙ্গীয় উপভাষায় পরিবর্তিত হয়ে হয় দিনাজপুর। গৌড় সংলগ্ন সনাতনী রাজ্য দিনাজপুর পাঠান, মুঘল ও নবাবদের বহু যুদ্ধে পরাস্ত করে চিরকাল এসেছে।[১] সপ্তদশ শতাব্দীর শেষের দিকে শ্রীমন্ত দত্ত চৌধুরী দিনাজপুরের জমিদার হন। কিন্তু শ্রীমন্ত দত্ত চৌধুরীর ছেলের অকাল মৃত্যুর হওয়াতে, তার ভাগ্নে “সুখদেব ঘোষ” তার সম্পত্তির উত্তরাধিকার হন।",
      architecture:
          "আসলে বর্তমানে দিনাজপুর রাজবাড়ি বলতে এর অবশিষ্টাংশকে বুঝায়। এর বেশিরভাগ অংশ ধ্বংস হয়ে গেছে। শুধু গুটিকয়েক স্থাপনা এখন বিদ্যমান। রাজবাড়ির প্রবেশ পথে পশ্চিমমুখী একটি মিনার আকৃতির বিশাল তৌরণ আছে। রাজবাড়ির সীমানার মধ্যে তৌরণের কিছু দূরে বামদিকে একটি উজ্জ্বল রঙ করা কৃষ্ণ মন্দির এবং ডানদিকে রাজবাড়ির বহিঃমহলের কিছু ধ্বংসাবশেষ আছে। রাজবাড়ির সীমানার ভেতরে আরকটি তৌরণ আছে, যার মাধ্যমে রাজবাড়ির প্রধান বর্গাকার অংশে প্রবেশ করা হয়। রাজবাড়ির প্রধান অংশের পূর্বদিকে আরেকটি সমতল ছাদবিশিষ্ট মন্দির আছে। যার মধ্যে অনেক হিন্দু দেবতার প্রতিমা বিদ্যমান।\n\nরাজবাড়ি প্রধানত তিনটি মহল বা ব্লকের সমন্বয়ে গঠিত, যথাক্রমেঃ আয়না মহল, রাণি মহল ও ঠাকুরবাটি মহল। এর পাশাপাশি আরো কিছু অপ্রধান কিছু স্থাপনা আছে। যা জমিদার পরিবারের বিভিন্ন রাজা ও উত্তরাধিকার কর্তৃক বিভিন্ন সময়ে প্রতিষ্ঠিত। এই রাজবাড়ির সীমানায় আরো কিছু মন্দির, বিশ্রামাগার, দাতব্য চিকিৎসালয়, পানির ট্যাঙ্ক ও আমলাদের বাসস্থান স্থাপিত হয়। দিনাজপুর রাজবাড়ির ভূমির মোট আয়তন ১৬.৪১ একর যার মধ্যে পূর্ব ও পশ্চিম দিকে ২ বৃহৎ পানির চৌবাচ্চা/ট্যাঙ্ক, মঠ, বাগান, কাঁচারী ঘর, টেনিস কোর্ট ও কুমারের বাড়ি অন্তর্ভুক্ত। এছাড়া রাজবাড়ির মুল অংশে দুইটি পুকুর রয়েছে, যার একটি রানিপুকুর নামে পরিচিত। এবং রাজবাড়ির পিছনে আরো দুইটি বিশালাকৃতির পুকুর (পদ্মপুকুর ও সুখসাগর) রয়েছে। রাজবাড়ির 'হিরাবাগান'নামে একটি মাঠ রয়েছে। বর্তমানে রাজবাড়িটিকে দুইটি অংশে ভাগ করা হয়েছে। সামনের অংশ অর্থাৎ মন্দির অংশে প্রতিবছর ধর্মীয় ভাবভঙ্গীমায় কান্তজিওঁ ও দুর্গাপুজা করা হয়। এই অংশটি 'রাজদেবত্তর এস্টেট' নামে মন্দির কমিটির দ্বারা সংরক্ষণ করা হয়েছে। অপর অংশটি অর্থ্যাৎ আয়নামহল ও রানিমহল ধ্বংসপ্রায় অবস্থায় রয়েছে যেখানে প্রাচীন স্থাপত্যশৈলী ও কারুকার্য এখনও দেখা যায়। লোহার তৈরী কলাম ও বীম গুলো চুরি হয়ে গিয়েছে। পুরো জায়গাটি বৃহদাকার আম,জাম,লিচু,কাঠাল ও অন্যান্য জংলী গাছ দ্বারা আবৃত। পাশেই বাংলাদেশ সরকার পরিচালিত সরকারি এতিমখানা 'শিশুপরিবার' রয়েছে। ইতঃপূর্বে মহান জাতীয় সংসদের মাননীয় হুইপ জনাব ইকবালুর রহিমের পৃষ্ঠপোষকতায় শিশুপরিবারের জন্য একটি অত্যাধুনিক ও দৃষ্টিনন্দন চারতলা ইমারত ও একটি বৃদ্ধাশ্রম নির্মাণ করা হয়েছে। রানিপুকুরের পাশে একটি পুরোনো দ্বিতল বিল্ডিং শিশুপরিবারের শিক্ষক-কর্মচারীদের কোয়ার্টার হিসেবে ব্যবহৃত হয়।\n\nএই বিশাল রাজবাড়িটি একটি আকর্ষণীয় ঐতিহাসিক ঐতিহ্য। যা প্রত্নতাত্ত্বিক গবেষণা ও টুরিজম স্পট হতে পারে। কিন্তু এটি বাংলাদেশ সরকারের প্রত্নতত্ত্ব বিভাগ কর্তৃক কর্তৃক স্বীকৃত নয়। তাই এই বিশাল স্থাপনাটি অযত্নে অবহেলায় ধ্বংস হয়ে যাচ্ছে। জনগণ সাধারণত এই স্থানে আবর্জনা ফেলায় এর বিদ্যামান অংশও ধ্বংসপ্রায়। অবিলম্বে স্থাপনাটি সংরক্ষণ না করা হলে এটি কালের গর্ভে বিলিন হয়ে যাবে।")
];

List<String> firstImageUrls =
    places.map((place) => place.imageUrlsOfSelectedPlace!.first).toList();
